nxp-mcuxpresso/mcux-sdk/devices/KW45B41Z53/KW45B41Z53.h
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_q_MASK (0xFFFFU)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_q_SHIFT (0U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_q(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_q_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_q_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_i_MASK (0xFFFF0000U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_i_SHIFT (16U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_i(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_i_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER2_rx_tone_ana_out_i_MASK)
/*! @} */

/*! @name DFT_TONE_ANALYZER3 - DfT tone analyzer */
/*! @{ */

#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_ipr_dft_ana_accumulation_length_MASK (0x7FFFU)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_ipr_dft_ana_accumulation_length_SHIFT (0U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_ipr_dft_ana_accumulation_length(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER3_ipr_dft_ana_accumulation_length_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER3_ipr_dft_ana_accumulation_length_MASK)

#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_rx_tone_ana_out_abs_MASK (0x7FFF8000U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_rx_tone_ana_out_abs_SHIFT (15U)
#define XCVR_RX_DIG_DFT_TONE_ANALYZER3_rx_tone_ana_out_abs(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DFT_TONE_ANALYZER3_rx_tone_ana_out_abs_SHIFT)) & XCVR_RX_DIG_DFT_TONE_ANALYZER3_rx_tone_ana_out_abs_MASK)
/*! @} */

/*! @name DCOC_DIG_CORR_RESULT - DCOC Digital Correction Result */
/*! @{ */

#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q_MASK (0xFFU)
#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q_SHIFT (0U)
/*! DCOC_DIG_CORR_Q - DCOC I-Channel Residual After Calibration */
#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q_SHIFT)) & XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_Q_MASK)

#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I_MASK (0xFF00U)
#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I_SHIFT (8U)
/*! DCOC_DIG_CORR_I - DCOC Q-Channel Residual After Calibration */
#define XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I(x) (((uint32_t)(((uint32_t)(x)) << XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I_SHIFT)) & XCVR_RX_DIG_DCOC_DIG_CORR_RESULT_DCOC_DIG_CORR_I_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XCVR_RX_DIG_Register_Masks */


/* XCVR_RX_DIG - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral XCVR_RX_DIG base address */
  #define XCVR_RX_DIG_BASE                         (0x58A07000u)
  /** Peripheral XCVR_RX_DIG base address */
  #define XCVR_RX_DIG_BASE_NS                      (0x48A07000u)
  /** Peripheral XCVR_RX_DIG base pointer */
  #define XCVR_RX_DIG                              ((XCVR_RX_DIG_Type *)XCVR_RX_DIG_BASE)
  /** Peripheral XCVR_RX_DIG base pointer */
  #define XCVR_RX_DIG_NS                           ((XCVR_RX_DIG_Type *)XCVR_RX_DIG_BASE_NS)
  /** Array initializer of XCVR_RX_DIG peripheral base addresses */
  #define XCVR_RX_DIG_BASE_ADDRS                   { XCVR_RX_DIG_BASE }
  /** Array initializer of XCVR_RX_DIG peripheral base pointers */
  #define XCVR_RX_DIG_BASE_PTRS                    { XCVR_RX_DIG }
  /** Array initializer of XCVR_RX_DIG peripheral base addresses */
  #define XCVR_RX_DIG_BASE_ADDRS_NS                { XCVR_RX_DIG_BASE_NS }
  /** Array initializer of XCVR_RX_DIG peripheral base pointers */
  #define XCVR_RX_DIG_BASE_PTRS_NS                 { XCVR_RX_DIG_NS }
#else
  /** Peripheral XCVR_RX_DIG base address */
  #define XCVR_RX_DIG_BASE                         (0x48A07000u)
  /** Peripheral XCVR_RX_DIG base pointer */
  #define XCVR_RX_DIG                              ((XCVR_RX_DIG_Type *)XCVR_RX_DIG_BASE)
  /** Array initializer of XCVR_RX_DIG peripheral base addresses */
  #define XCVR_RX_DIG_BASE_ADDRS                   { XCVR_RX_DIG_BASE }
  /** Array initializer of XCVR_RX_DIG peripheral base pointers */
  #define XCVR_RX_DIG_BASE_PTRS                    { XCVR_RX_DIG }
#endif

/*!
 * @}
 */ /* end of group XCVR_RX_DIG_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- XCVR_TSM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XCVR_TSM_Peripheral_Access_Layer XCVR_TSM Peripheral Access Layer
 * @{
 */

/** XCVR_TSM - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL;                              /**< TSM CONTROL, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __IO uint32_t END_OF_SEQ;                        /**< TSM END OF SEQUENCE, offset: 0x8 */
  __IO uint32_t WU_LATENCY;                        /**< WARMUP LATENCY, offset: 0xC */
  __IO uint32_t RECYCLE_COUNT;                     /**< TSM RECYCLE COUNT, offset: 0x10 */
  __IO uint32_t FAST_CTRL1;                        /**< TSM FAST WARMUP CONTROL 1, offset: 0x14 */
  __IO uint32_t FAST_CTRL2;                        /**< TSM FAST WARMUP CONTROL 2, offset: 0x18 */
  __IO uint32_t FAST_CTRL3;                        /**< TSM FAST WARMUP CONTROL 3, offset: 0x1C */
  __IO uint32_t TIMING00;                          /**< TSM_TIMING00, offset: 0x20 */
  __IO uint32_t TIMING01;                          /**< TSM_TIMING01, offset: 0x24 */
  __IO uint32_t TIMING02;                          /**< TSM_TIMING02, offset: 0x28 */
  __IO uint32_t TIMING03;                          /**< TSM_TIMING03, offset: 0x2C */
  __IO uint32_t TIMING04;                          /**< TSM_TIMING04, offset: 0x30 */
  __IO uint32_t TIMING05;                          /**< TSM_TIMING05, offset: 0x34 */
  __IO uint32_t TIMING06;                          /**< TSM_TIMING06, offset: 0x38 */
  __IO uint32_t TIMING07;                          /**< TSM_TIMING07, offset: 0x3C */
  __IO uint32_t TIMING08;                          /**< TSM_TIMING08, offset: 0x40 */
  __IO uint32_t TIMING09;                          /**< TSM_TIMING09, offset: 0x44 */
  __IO uint32_t TIMING10;                          /**< TSM_TIMING10, offset: 0x48 */
  __IO uint32_t TIMING11;                          /**< TSM_TIMING11, offset: 0x4C */
  __IO uint32_t TIMING12;                          /**< TSM_TIMING12, offset: 0x50 */
  __IO uint32_t TIMING13;                          /**< TSM_TIMING13, offset: 0x54 */
  __IO uint32_t TIMING14;                          /**< TSM_TIMING14, offset: 0x58 */
  __IO uint32_t TIMING15;                          /**< TSM_TIMING15, offset: 0x5C */
  __IO uint32_t TIMING16;                          /**< TSM_TIMING16, offset: 0x60 */
  __IO uint32_t TIMING17;                          /**< TSM_TIMING17, offset: 0x64 */
  __IO uint32_t TIMING18;                          /**< TSM_TIMING18, offset: 0x68 */
  __IO uint32_t TIMING19;                          /**< TSM_TIMING19, offset: 0x6C */
  __IO uint32_t TIMING20;                          /**< TSM_TIMING20, offset: 0x70 */
  __IO uint32_t TIMING21;                          /**< TSM_TIMING21, offset: 0x74 */
  __IO uint32_t TIMING22;                          /**< TSM_TIMING22, offset: 0x78 */
  __IO uint32_t TIMING23;                          /**< TSM_TIMING23, offset: 0x7C */
  __IO uint32_t TIMING24;                          /**< TSM_TIMING24, offset: 0x80 */
  __IO uint32_t TIMING25;                          /**< TSM_TIMING25, offset: 0x84 */
  __IO uint32_t TIMING26;                          /**< TSM_TIMING26, offset: 0x88 */
  __IO uint32_t TIMING27;                          /**< TSM_TIMING27, offset: 0x8C */
  __IO uint32_t TIMING28;                          /**< TSM_TIMING28, offset: 0x90 */
  __IO uint32_t TIMING29;                          /**< TSM_TIMING29, offset: 0x94 */
  __IO uint32_t TIMING30;                          /**< TSM_TIMING30, offset: 0x98 */
  __IO uint32_t TIMING31;                          /**< TSM_TIMING31, offset: 0x9C */
  __IO uint32_t TIMING32;                          /**< TSM_TIMING32, offset: 0xA0 */
  __IO uint32_t TIMING33;                          /**< TSM_TIMING33, offset: 0xA4 */
  __IO uint32_t TIMING34;                          /**< TSM_TIMING34, offset: 0xA8 */
  __IO uint32_t TIMING35;                          /**< TSM_TIMING35, offset: 0xAC */
  __IO uint32_t TIMING36;                          /**< TSM_TIMING36, offset: 0xB0 */
  __IO uint32_t TIMING37;                          /**< TSM_TIMING37, offset: 0xB4 */
  __IO uint32_t TIMING38;                          /**< TSM_TIMING38, offset: 0xB8 */
  __IO uint32_t TIMING39;                          /**< TSM_TIMING39, offset: 0xBC */
  __IO uint32_t TIMING40;                          /**< TSM_TIMING40, offset: 0xC0 */
  __IO uint32_t TIMING41;                          /**< TSM_TIMING41, offset: 0xC4 */
  __IO uint32_t TIMING42;                          /**< TSM_TIMING42, offset: 0xC8 */
  __IO uint32_t TIMING43;                          /**< TSM_TIMING43, offset: 0xCC */
  __IO uint32_t TIMING44;                          /**< TSM_TIMING44, offset: 0xD0 */
  __IO uint32_t TIMING45;                          /**< TSM_TIMING45, offset: 0xD4 */
  __IO uint32_t TIMING46;                          /**< TSM_TIMING46, offset: 0xD8 */
  __IO uint32_t TIMING47;                          /**< TSM_TIMING47, offset: 0xDC */
  __IO uint32_t TIMING48;                          /**< TSM_TIMING48, offset: 0xE0 */
  __IO uint32_t TIMING49;                          /**< TSM_TIMING49, offset: 0xE4 */
  __IO uint32_t TIMING50;                          /**< TSM_TIMING50, offset: 0xE8 */
  __IO uint32_t TIMING51;                          /**< TSM_TIMING51, offset: 0xEC */
  __IO uint32_t TIMING52;                          /**< TSM_TIMING52, offset: 0xF0 */
  __IO uint32_t OVRD0;                             /**< TSM OVERRIDE REGISTER 0, offset: 0xF4 */
  __IO uint32_t OVRD1;                             /**< TSM OVERRIDE REGISTER 1, offset: 0xF8 */
  __IO uint32_t OVRD2;                             /**< TSM OVERRIDE REGISTER 2, offset: 0xFC */
  __IO uint32_t OVRD3;                             /**< TSM OVERRIDE REGISTER 3, offset: 0x100 */
} XCVR_TSM_Type;

/* ----------------------------------------------------------------------------
   -- XCVR_TSM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XCVR_TSM_Register_Masks XCVR_TSM Register Masks
 * @{
 */

/*! @name CTRL - TSM CONTROL */
/*! @{ */

